/* automatically generated by rust-bindgen 0.54.1 */
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

pub const OpenMM_NmPerAngstrom: f64 = 0.1;
pub const OpenMM_AngstromsPerNm: f64 = 10.0;
pub const OpenMM_PsPerFs: f64 = 0.001;
pub const OpenMM_FsPerPs: f64 = 1000.0;
pub const OpenMM_KJPerKcal: f64 = 4.184;
pub const OpenMM_KcalPerKJ: f64 = 0.2390057361376673;
pub const OpenMM_RadiansPerDegree: f64 = 0.017453292519943295;
pub const OpenMM_DegreesPerRadian: f64 = 57.29577951308232;
pub const OpenMM_SigmaPerVdwRadius: f64 = 1.7817974362806785;
pub const OpenMM_VdwRadiusPerSigma: f64 = 0.5612310241546865;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Context_struct {
    _unused: [u8; 0],
}
pub type OpenMM_Context = OpenMM_Context_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_TabulatedFunction_struct {
    _unused: [u8; 0],
}
pub type OpenMM_TabulatedFunction = OpenMM_TabulatedFunction_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Discrete2DFunction_struct {
    _unused: [u8; 0],
}
pub type OpenMM_Discrete2DFunction = OpenMM_Discrete2DFunction_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Force_struct {
    _unused: [u8; 0],
}
pub type OpenMM_Force = OpenMM_Force_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_CustomAngleForce_struct {
    _unused: [u8; 0],
}
pub type OpenMM_CustomAngleForce = OpenMM_CustomAngleForce_struct;
#[repr(C)]

    _unused: [u8; 0],
}
pub type OpenMM_Discrete1DFunction = OpenMM_Discrete1DFunction_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_CustomTorsionForce_struct {
    _unused: [u8; 0],
}
pub type OpenMM_CustomTorsionForce = OpenMM_CustomTorsionForce_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_HarmonicBondForce_struct {
    _unused: [u8; 0],
}
pub type OpenMM_HarmonicBondForce = OpenMM_HarmonicBondForce_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_CustomGBForce_struct {
    _unused: [u8; 0],
}
pub type OpenMM_CustomGBForce = OpenMM_CustomGBForce_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_RMSDForce_struct {
    _unused: [u8; 0],
}
pub type OpenMM_RMSDForce = OpenMM_RMSDForce_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_CustomExternalForce_struct {
    _unused: [u8; 0],
}
pub type OpenMM_CustomExternalForce = OpenMM_CustomExternalForce_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Continuous2DFunction_struct {
    _unused: [u8; 0],
}
pub type OpenMM_Continuous2DFunction = OpenMM_Continuous2DFunction_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_CMMotionRemover_struct {
    _unused: [u8; 0],
}
pub type OpenMM_CMMotionRemover = OpenMM_CMMotionRemover_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Platform_struct {
    _unused: [u8; 0],
}
pub type OpenMM_Platform = OpenMM_Platform_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Vec3Array_struct {
    _unused: [u8; 0],
}
pub type OpenMM_Vec3Array = OpenMM_Vec3Array_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_StringArray_struct {
    _unused: [u8; 0],
}
pub type OpenMM_StringArray = OpenMM_StringArray_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_BondArray_struct {
    _unused: [u8; 0],
}
pub type OpenMM_BondArray = OpenMM_BondArray_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_ParameterArray_struct {
    _unused: [u8; 0],
}
pub type OpenMM_ParameterArray = OpenMM_ParameterArray_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_PropertyArray_struct {
    _unused: [u8; 0],
}
pub type OpenMM_PropertyArray = OpenMM_PropertyArray_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_DoubleArray_struct {
    _unused: [u8; 0],
}
pub type OpenMM_DoubleArray = OpenMM_DoubleArray_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_IntArray_struct {
    _unused: [u8; 0],
}
pub type OpenMM_IntArray = OpenMM_IntArray_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_IntSet_struct {
    _unused: [u8; 0],
}
pub type OpenMM_IntSet = OpenMM_IntSet_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OpenMM_Vec3 {
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
#[test]
fn bindgen_test_layout_OpenMM_Vec3() {
    assert_eq!(
        ::std::mem::size_of::<OpenMM_Vec3>(),
        24usize,
        concat!("Size of: ", stringify!(OpenMM_Vec3))
    );
    assert_eq!(
        ::std::mem::align_of::<OpenMM_Vec3>(),
        8usize,
        concat!("Alignment of ", stringify!(OpenMM_Vec3))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpenMM_Vec3>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OpenMM_Vec3),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpenMM_Vec3>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OpenMM_Vec3),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OpenMM_Vec3>())).z as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(OpenMM_Vec3),
            "::",
            stringify!(z)
        )
    );
}
pub const OpenMM_Boolean_OpenMM_False: OpenMM_Boolean = 0;
pub const OpenMM_Boolean_OpenMM_True: OpenMM_Boolean = 1;
pub type OpenMM_Boolean = u32;
extern "C" {
    pub fn OpenMM_Vec3_scale(vec: OpenMM_Vec3, scale: f64) -> OpenMM_Vec3;
}
extern "C" {
    pub fn OpenMM_Vec3Array_create(size: ::std::os::raw::c_int) -> *mut OpenMM_Vec3Array;
}
extern "C" {
    pub fn OpenMM_Vec3Array_destroy(array: *mut OpenMM_Vec3Array);
}
extern "C" {
    pub fn OpenMM_Vec3Array_getSize(array: *const OpenMM_Vec3Array) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn OpenMM_Vec3Array_resize(array: *mut OpenMM_Vec3Array, size: ::std::os::raw::c_int);
}
extern "C" {
    pub fn OpenMM_Vec3Array_append(array: *mut OpenMM_Vec3Array, vec: OpenMM_Vec3);
}
extern "C" {
    pub fn OpenMM_Vec3Array_set(
        array: *mut OpenMM_Vec3Array,
        index: ::std::os::raw::c_int,
